; domain
(define (domain sokoban-domain)
  (:requirements :equality)
  (:predicates (has_player ?x)
               (has_box ?x)
               (adjacent ?x ?y)
               (adjacent_2 ?x ?y))
  (:action move-player
           :parameters (?x ?y)
           :precondition (and (adjacent ?x ?y)
                              (not (has_box ?y))
                              (has_player ?x))
           :effect		   (and (has_player ?y)
                              (not (has_player ?x))))
  (:action push-box
		   :parameters (?x ?y ?z)
		   :precondition (and (has_player ?x)
                          (has_box ?y)
                          (not (has_box ?z))
                          (adjacent ?x ?y)
                          (adjacent ?y ?z)
                          (adjacent_2 ?x ?z))
	       :effect (and (has_box ?z)
						(not(has_box ?y))
						(has_player ?y)
						(not(has_player ?x))))
  )

; problem
(define (problem simple)
  (:domain sokoban-domain)
  (:objects s_1_7 s_1_8 s_1_9 s_2_7 s_2_9 s_3_7 s_3_9 s_4_1 s_4_2 s_4_3 s_4_4 s_4_5 s_4_6 s_4_7 s_4_8 s_4_9 s_5_1 s_5_3 s_5_5 s_5_7 s_6_1 s_6_2 s_6_3 s_6_4 s_6_5 s_6_6 s_6_7)
  (:init
     (adjacent s_1_7 s_2_7) (adjacent s_1_7 s_1_8) 
	 (adjacent s_1_8 s_1_9) (adjacent s_1_8 s_1_7) 
	 (adjacent s_1_9 s_2_9) (adjacent s_1_9 s_1_8) 
	 (adjacent s_2_7 s_3_7) (adjacent s_2_7 s_1_7) 
	 (adjacent s_2_9 s_3_9) (adjacent s_2_9 s_1_9) 
	 (adjacent s_3_7 s_4_7) (adjacent s_3_7 s_2_7) 
	 (adjacent s_3_9 s_4_9) (adjacent s_3_9 s_2_9) 
	 (adjacent s_4_1 s_5_1) (adjacent s_4_1 s_4_2) 
	 (adjacent s_4_2 s_4_3) (adjacent s_4_2 s_4_1) 
	 (adjacent s_4_3 s_5_3) (adjacent s_4_3 s_4_4) 
	 (adjacent s_4_3 s_4_2) (adjacent s_4_4 s_4_5) 
	 (adjacent s_4_4 s_4_3) (adjacent s_4_5 s_5_5) 
	 (adjacent s_4_5 s_4_6) (adjacent s_4_5 s_4_4) 
	 (adjacent s_4_6 s_4_7) (adjacent s_4_6 s_4_5) 
	 (adjacent s_4_7 s_5_7) (adjacent s_4_7 s_4_8) 
	 (adjacent s_4_7 s_3_7) (adjacent s_4_7 s_4_6) 
	 (adjacent s_4_8 s_4_9) (adjacent s_4_8 s_4_7) 
	 (adjacent s_4_9 s_3_9) (adjacent s_4_9 s_4_8) 
	 (adjacent s_5_1 s_6_1) (adjacent s_5_1 s_4_1) 
	 (adjacent s_5_3 s_6_3) (adjacent s_5_3 s_4_3) 
	 (adjacent s_5_5 s_6_5) (adjacent s_5_5 s_4_5) 
	 (adjacent s_5_7 s_6_7) (adjacent s_5_7 s_4_7) 
	 (adjacent s_6_1 s_6_2) (adjacent s_6_1 s_5_1) 
	 (adjacent s_6_2 s_6_3) (adjacent s_6_2 s_6_1) 
	 (adjacent s_6_3 s_6_4) (adjacent s_6_3 s_5_3) 
	 (adjacent s_6_3 s_6_2) (adjacent s_6_4 s_6_5) 
	 (adjacent s_6_4 s_6_3) (adjacent s_6_5 s_6_6) 
	 (adjacent s_6_5 s_5_5) (adjacent s_6_5 s_6_4) 
	 (adjacent s_6_6 s_6_7) (adjacent s_6_6 s_6_5) 
	 (adjacent s_6_7 s_5_7) (adjacent s_6_7 s_6_6)
     (adjacent_2 s_1_7 s_3_7) (adjacent_2 s_1_7 s_1_9) 
	 (adjacent_2 s_1_9 s_3_9) (adjacent_2 s_1_9 s_1_7) 
	 (adjacent_2 s_2_7 s_4_7) (adjacent_2 s_2_7 s_2_9) 
	 (adjacent_2 s_2_9 s_4_9) (adjacent_2 s_2_9 s_2_7) 
	 (adjacent_2 s_3_7 s_5_7) (adjacent_2 s_3_7 s_3_9) 
	 (adjacent_2 s_3_7 s_1_7) (adjacent_2 s_3_9 s_1_9)
	 (adjacent_2 s_3_9 s_3_7) (adjacent_2 s_4_1 s_6_1) 
	 (adjacent_2 s_4_1 s_4_3) (adjacent_2 s_4_2 s_6_2) 
	 (adjacent_2 s_4_2 s_4_4) (adjacent_2 s_4_3 s_6_3) 
	 (adjacent_2 s_4_3 s_4_5) (adjacent_2 s_4_3 s_4_1) 
	 (adjacent_2 s_4_4 s_6_4) (adjacent_2 s_4_4 s_4_6) 
	 (adjacent_2 s_4_4 s_4_2) (adjacent_2 s_4_5 s_6_5) 
	 (adjacent_2 s_4_5 s_4_7) (adjacent_2 s_4_5 s_4_3) 
	 (adjacent_2 s_4_6 s_6_6) (adjacent_2 s_4_6 s_4_8) 
	 (adjacent_2 s_4_6 s_4_4) (adjacent_2 s_4_7 s_6_7) 
	 (adjacent_2 s_4_7 s_4_9) (adjacent_2 s_4_7 s_2_7) 
	 (adjacent_2 s_4_7 s_4_5) (adjacent_2 s_4_8 s_4_6) 
	 (adjacent_2 s_4_9 s_2_9) (adjacent_2 s_4_9 s_4_7) 
	 (adjacent_2 s_5_1 s_5_3) (adjacent_2 s_5_3 s_5_5) 
	 (adjacent_2 s_5_3 s_5_1) (adjacent_2 s_5_5 s_5_7) 
	 (adjacent_2 s_5_5 s_5_3) (adjacent_2 s_5_7 s_3_7) 
	 (adjacent_2 s_5_7 s_5_5) (adjacent_2 s_6_1 s_6_3) 
	 (adjacent_2 s_6_1 s_4_1) (adjacent_2 s_6_2 s_6_4) 
	 (adjacent_2 s_6_2 s_4_2) (adjacent_2 s_6_3 s_6_5) 
	 (adjacent_2 s_6_3 s_4_3) (adjacent_2 s_6_3 s_6_1) 
	 (adjacent_2 s_6_4 s_6_6) (adjacent_2 s_6_4 s_4_4) 
	 (adjacent_2 s_6_4 s_6_2) (adjacent_2 s_6_5 s_6_7) 
	 (adjacent_2 s_6_5 s_4_5) (adjacent_2 s_6_5 s_6_3) 
	 (adjacent_2 s_6_6 s_4_6) (adjacent_2 s_6_6 s_6_4) 
	 (adjacent_2 s_6_7 s_4_7) (adjacent_2 s_6_7 s_6_5)
     (has_player s_4_2)
     (has_box s_4_4) (has_box s_4_6) (has_box s_4_8))
  (:goal (and (has_box s_1_7) (has_box s_2_7) (has_box s_3_7)))
)

; plan
1. (move-player s_4_2 s_4_3)
   deleted: (has_player s_4_2)
   added: (has_player s_4_3)
   goals met: 0 of 3
2. (move-player s_4_3 s_5_3)
   deleted: (has_player s_4_3)
   added: (has_player s_5_3)
   goals met: 0 of 3
3. (move-player s_5_3 s_6_3)
   deleted: (has_player s_5_3)
   added: (has_player s_6_3)
   goals met: 0 of 3
4. (move-player s_6_3 s_6_4)
   deleted: (has_player s_6_3)
   added: (has_player s_6_4)
   goals met: 0 of 3
5. (move-player s_6_4 s_6_5)
   deleted: (has_player s_6_4)
   added: (has_player s_6_5)
   goals met: 0 of 3
6. (move-player s_6_5 s_5_5)
   deleted: (has_player s_6_5)
   added: (has_player s_5_5)
   goals met: 0 of 3
7. (move-player s_5_5 s_4_5)
   deleted: (has_player s_5_5)
   added: (has_player s_4_5)
   goals met: 0 of 3
8. (push-box s_4_5 s_4_4 s_4_3)
   deleted: (has_box s_4_4) (has_player s_4_5)
   added: (has_box s_4_3) (has_player s_4_4)
   goals met: 0 of 3
9. (push-box s_4_4 s_4_3 s_4_2)
   deleted: (has_box s_4_3) (has_player s_4_4)
   added: (has_box s_4_2) (has_player s_4_3)
   goals met: 0 of 3
10. (move-player s_4_3 s_4_4)
   deleted: (has_player s_4_3)
   added: (has_player s_4_4)
   goals met: 0 of 3
11. (move-player s_4_4 s_4_5)
   deleted: (has_player s_4_4)
   added: (has_player s_4_5)
   goals met: 0 of 3
12. (move-player s_4_5 s_5_5)
   deleted: (has_player s_4_5)
   added: (has_player s_5_5)
   goals met: 0 of 3
13. (move-player s_5_5 s_6_5)
   deleted: (has_player s_5_5)
   added: (has_player s_6_5)
   goals met: 0 of 3
14. (move-player s_6_5 s_6_6)
   deleted: (has_player s_6_5)
   added: (has_player s_6_6)
   goals met: 0 of 3
15. (move-player s_6_6 s_6_7)
   deleted: (has_player s_6_6)
   added: (has_player s_6_7)
   goals met: 0 of 3
16. (move-player s_6_7 s_5_7)
   deleted: (has_player s_6_7)
   added: (has_player s_5_7)
   goals met: 0 of 3
17. (move-player s_5_7 s_4_7)
   deleted: (has_player s_5_7)
   added: (has_player s_4_7)
   goals met: 0 of 3
18. (push-box s_4_7 s_4_6 s_4_5)
   deleted: (has_box s_4_6) (has_player s_4_7)
   added: (has_box s_4_5) (has_player s_4_6)
   goals met: 0 of 3
19. (push-box s_4_6 s_4_5 s_4_4)
   deleted: (has_box s_4_5) (has_player s_4_6)
   added: (has_box s_4_4) (has_player s_4_5)
   goals met: 0 of 3
20. (move-player s_4_5 s_4_6)
   deleted: (has_player s_4_5)
   added: (has_player s_4_6)
   goals met: 0 of 3
21. (move-player s_4_6 s_4_7)
   deleted: (has_player s_4_6)
   added: (has_player s_4_7)
   goals met: 0 of 3
22. (move-player s_4_7 s_3_7)
   deleted: (has_player s_4_7)
   added: (has_player s_3_7)
   goals met: 0 of 3
23. (move-player s_3_7 s_2_7)
   deleted: (has_player s_3_7)
   added: (has_player s_2_7)
   goals met: 0 of 3
24. (move-player s_2_7 s_1_7)
   deleted: (has_player s_2_7)
   added: (has_player s_1_7)
   goals met: 0 of 3
25. (move-player s_1_7 s_1_8)
   deleted: (has_player s_1_7)
   added: (has_player s_1_8)
   goals met: 0 of 3
26. (move-player s_1_8 s_1_9)
   deleted: (has_player s_1_8)
   added: (has_player s_1_9)
   goals met: 0 of 3
27. (move-player s_1_9 s_2_9)
   deleted: (has_player s_1_9)
   added: (has_player s_2_9)
   goals met: 0 of 3
28. (move-player s_2_9 s_3_9)
   deleted: (has_player s_2_9)
   added: (has_player s_3_9)
   goals met: 0 of 3
29. (move-player s_3_9 s_4_9)
   deleted: (has_player s_3_9)
   added: (has_player s_4_9)
   goals met: 0 of 3
30. (push-box s_4_9 s_4_8 s_4_7)
   deleted: (has_box s_4_8) (has_player s_4_9)
   added: (has_box s_4_7) (has_player s_4_8)
   goals met: 0 of 3
31. (push-box s_4_8 s_4_7 s_4_6)
   deleted: (has_box s_4_7) (has_player s_4_8)
   added: (has_box s_4_6) (has_player s_4_7)
   goals met: 0 of 3
32. (move-player s_4_7 s_5_7)
   deleted: (has_player s_4_7)
   added: (has_player s_5_7)
   goals met: 0 of 3
33. (move-player s_5_7 s_6_7)
   deleted: (has_player s_5_7)
   added: (has_player s_6_7)
   goals met: 0 of 3
34. (move-player s_6_7 s_6_6)
   deleted: (has_player s_6_7)
   added: (has_player s_6_6)
   goals met: 0 of 3
35. (move-player s_6_6 s_6_5)
   deleted: (has_player s_6_6)
   added: (has_player s_6_5)
   goals met: 0 of 3
36. (move-player s_6_5 s_5_5)
   deleted: (has_player s_6_5)
   added: (has_player s_5_5)
   goals met: 0 of 3
37. (move-player s_5_5 s_4_5)
   deleted: (has_player s_5_5)
   added: (has_player s_4_5)
   goals met: 0 of 3
38. (push-box s_4_5 s_4_6 s_4_7)
   deleted: (has_box s_4_6) (has_player s_4_5)
   added: (has_box s_4_7) (has_player s_4_6)
   goals met: 0 of 3
39. (move-player s_4_6 s_4_5)
   deleted: (has_player s_4_6)
   added: (has_player s_4_5)
   goals met: 0 of 3
40. (move-player s_4_5 s_5_5)
   deleted: (has_player s_4_5)
   added: (has_player s_5_5)
   goals met: 0 of 3
41. (move-player s_5_5 s_6_5)
   deleted: (has_player s_5_5)
   added: (has_player s_6_5)
   goals met: 0 of 3
42. (move-player s_6_5 s_6_6)
   deleted: (has_player s_6_5)
   added: (has_player s_6_6)
   goals met: 0 of 3
43. (move-player s_6_6 s_6_7)
   deleted: (has_player s_6_6)
   added: (has_player s_6_7)
   goals met: 0 of 3
44. (move-player s_6_7 s_5_7)
   deleted: (has_player s_6_7)
   added: (has_player s_5_7)
   goals met: 0 of 3
45. (push-box s_5_7 s_4_7 s_3_7)
   deleted: (has_box s_4_7) (has_player s_5_7)
   added: (has_box s_3_7) (has_player s_4_7)
   goals met: 1 of 3
46. (push-box s_4_7 s_3_7 s_2_7)
   deleted: (has_box s_3_7) (has_player s_4_7)
   added: (has_box s_2_7) (has_player s_3_7)
   goals met: 1 of 3
47. (push-box s_3_7 s_2_7 s_1_7)
   deleted: (has_box s_2_7) (has_player s_3_7)
   added: (has_box s_1_7) (has_player s_2_7)
   goals met: 1 of 3
48. (move-player s_2_7 s_3_7)
   deleted: (has_player s_2_7)
   added: (has_player s_3_7)
   goals met: 1 of 3
49. (move-player s_3_7 s_4_7)
   deleted: (has_player s_3_7)
   added: (has_player s_4_7)
   goals met: 1 of 3
50. (move-player s_4_7 s_4_6)
   deleted: (has_player s_4_7)
   added: (has_player s_4_6)
   goals met: 1 of 3
51. (move-player s_4_6 s_4_5)
   deleted: (has_player s_4_6)
   added: (has_player s_4_5)
   goals met: 1 of 3
52. (move-player s_4_5 s_5_5)
   deleted: (has_player s_4_5)
   added: (has_player s_5_5)
   goals met: 1 of 3
53. (move-player s_5_5 s_6_5)
   deleted: (has_player s_5_5)
   added: (has_player s_6_5)
   goals met: 1 of 3
54. (move-player s_6_5 s_6_4)
   deleted: (has_player s_6_5)
   added: (has_player s_6_4)
   goals met: 1 of 3
55. (move-player s_6_4 s_6_3)
   deleted: (has_player s_6_4)
   added: (has_player s_6_3)
   goals met: 1 of 3
56. (move-player s_6_3 s_5_3)
   deleted: (has_player s_6_3)
   added: (has_player s_5_3)
   goals met: 1 of 3
57. (move-player s_5_3 s_4_3)
   deleted: (has_player s_5_3)
   added: (has_player s_4_3)
   goals met: 1 of 3
58. (push-box s_4_3 s_4_4 s_4_5)
   deleted: (has_box s_4_4) (has_player s_4_3)
   added: (has_box s_4_5) (has_player s_4_4)
   goals met: 1 of 3
59. (push-box s_4_4 s_4_5 s_4_6)
   deleted: (has_box s_4_5) (has_player s_4_4)
   added: (has_box s_4_6) (has_player s_4_5)
   goals met: 1 of 3
60. (push-box s_4_5 s_4_6 s_4_7)
   deleted: (has_box s_4_6) (has_player s_4_5)
   added: (has_box s_4_7) (has_player s_4_6)
   goals met: 1 of 3
61. (move-player s_4_6 s_4_5)
   deleted: (has_player s_4_6)
   added: (has_player s_4_5)
   goals met: 1 of 3
62. (move-player s_4_5 s_5_5)
   deleted: (has_player s_4_5)
   added: (has_player s_5_5)
   goals met: 1 of 3
63. (move-player s_5_5 s_6_5)
   deleted: (has_player s_5_5)
   added: (has_player s_6_5)
   goals met: 1 of 3
64. (move-player s_6_5 s_6_6)
   deleted: (has_player s_6_5)
   added: (has_player s_6_6)
   goals met: 1 of 3
65. (move-player s_6_6 s_6_7)
   deleted: (has_player s_6_6)
   added: (has_player s_6_7)
   goals met: 1 of 3
66. (move-player s_6_7 s_5_7)
   deleted: (has_player s_6_7)
   added: (has_player s_5_7)
   goals met: 1 of 3
67. (push-box s_5_7 s_4_7 s_3_7)
   deleted: (has_box s_4_7) (has_player s_5_7)
   added: (has_box s_3_7) (has_player s_4_7)
   goals met: 2 of 3
68. (push-box s_4_7 s_3_7 s_2_7)
   deleted: (has_box s_3_7) (has_player s_4_7)
   added: (has_box s_2_7) (has_player s_3_7)
   goals met: 2 of 3
69. (move-player s_3_7 s_4_7)
   deleted: (has_player s_3_7)
   added: (has_player s_4_7)
   goals met: 2 of 3
70. (move-player s_4_7 s_4_6)
   deleted: (has_player s_4_7)
   added: (has_player s_4_6)
   goals met: 2 of 3
71. (move-player s_4_6 s_4_5)
   deleted: (has_player s_4_6)
   added: (has_player s_4_5)
   goals met: 2 of 3
72. (move-player s_4_5 s_4_4)
   deleted: (has_player s_4_5)
   added: (has_player s_4_4)
   goals met: 2 of 3
73. (move-player s_4_4 s_4_3)
   deleted: (has_player s_4_4)
   added: (has_player s_4_3)
   goals met: 2 of 3
74. (move-player s_4_3 s_5_3)
   deleted: (has_player s_4_3)
   added: (has_player s_5_3)
   goals met: 2 of 3
75. (move-player s_5_3 s_6_3)
   deleted: (has_player s_5_3)
   added: (has_player s_6_3)
   goals met: 2 of 3
76. (move-player s_6_3 s_6_2)
   deleted: (has_player s_6_3)
   added: (has_player s_6_2)
   goals met: 2 of 3
77. (move-player s_6_2 s_6_1)
   deleted: (has_player s_6_2)
   added: (has_player s_6_1)
   goals met: 2 of 3
78. (move-player s_6_1 s_5_1)
   deleted: (has_player s_6_1)
   added: (has_player s_5_1)
   goals met: 2 of 3
79. (move-player s_5_1 s_4_1)
   deleted: (has_player s_5_1)
   added: (has_player s_4_1)
   goals met: 2 of 3
80. (push-box s_4_1 s_4_2 s_4_3)
   deleted: (has_box s_4_2) (has_player s_4_1)
   added: (has_box s_4_3) (has_player s_4_2)
   goals met: 2 of 3
81. (push-box s_4_2 s_4_3 s_4_4)
   deleted: (has_box s_4_3) (has_player s_4_2)
   added: (has_box s_4_4) (has_player s_4_3)
   goals met: 2 of 3
82. (push-box s_4_3 s_4_4 s_4_5)
   deleted: (has_box s_4_4) (has_player s_4_3)
   added: (has_box s_4_5) (has_player s_4_4)
   goals met: 2 of 3
83. (push-box s_4_4 s_4_5 s_4_6)
   deleted: (has_box s_4_5) (has_player s_4_4)
   added: (has_box s_4_6) (has_player s_4_5)
   goals met: 2 of 3
84. (push-box s_4_5 s_4_6 s_4_7)
   deleted: (has_box s_4_6) (has_player s_4_5)
   added: (has_box s_4_7) (has_player s_4_6)
   goals met: 2 of 3
85. (move-player s_4_6 s_4_5)
   deleted: (has_player s_4_6)
   added: (has_player s_4_5)
   goals met: 2 of 3
86. (move-player s_4_5 s_5_5)
   deleted: (has_player s_4_5)
   added: (has_player s_5_5)
   goals met: 2 of 3
87. (move-player s_5_5 s_6_5)
   deleted: (has_player s_5_5)
   added: (has_player s_6_5)
   goals met: 2 of 3
88. (move-player s_6_5 s_6_6)
   deleted: (has_player s_6_5)
   added: (has_player s_6_6)
   goals met: 2 of 3
89. (move-player s_6_6 s_6_7)
   deleted: (has_player s_6_6)
   added: (has_player s_6_7)
   goals met: 2 of 3
90. (move-player s_6_7 s_5_7)
   deleted: (has_player s_6_7)
   added: (has_player s_5_7)
   goals met: 2 of 3
91. (push-box s_5_7 s_4_7 s_3_7)
   deleted: (has_box s_4_7) (has_player s_5_7)
   added: (has_box s_3_7) (has_player s_4_7)
   goals met: 3 of 3
